# RbsBuildingUseloadcredits Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsBuildingUseloadcredits Property
ParameterTypeId Class See Also
---
"Use Load Credits"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsBuildingUseloadcredits { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsBuildingUseloadcredits As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsBuildingUseloadcredits {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace